Beam of user-defined type does not fit into beam system with clear spacing layout rule. Beam type is reset to default.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId BeamSystemEdgeBeamTooWide { get; }
  Visual Basic
Public Shared ReadOnly Property BeamSystemEdgeBeamTooWide As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ BeamSystemEdgeBeamTooWide {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures BeamSystemFailures Class
  Autodesk.Revit.DB Namespace